Gandra-et-al/NanoLogger/Software/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

##############################################################

uno.name=Arduino Uno
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.speed=115200
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05
uno.bootloader.path=optiboot
uno.bootloader.file=optiboot_atmega328.hex
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.core=arduino
uno.build.variant=standard

##############################################################

atmega328.name=Arduino Duemilanove w/ ATmega328

atmega328.upload.protocol=arduino
atmega328.upload.maximum_size=30720
atmega328.upload.speed=57600

atmega328.bootloader.low_fuses=0xFF
atmega328.bootloader.high_fuses=0xDA
atmega328.bootloader.extended_fuses=0x05
atmega328.bootloader.path=atmega
atmega328.bootloader.file=ATmegaBOOT_168_atmega328.hex
atmega328.bootloader.unlock_bits=0x3F
atmega328.bootloader.lock_bits=0x0F

atmega328.build.mcu=atmega328p
atmega328.build.f_cpu=16000000L
atmega328.build.core=arduino
atmega328.build.variant=standard

##############################################################

diecimila.name=Arduino Diecimila or Duemilanove w/ ATmega168

diecimila.upload.protocol=arduino
diecimila.upload.maximum_size=14336
diecimila.upload.speed=19200

diecimila.bootloader.low_fuses=0xff
diecimila.bootloader.high_fuses=0xdd
diecimila.bootloader.extended_fuses=0x00
diecimila.bootloader.path=atmega
diecimila.bootloader.file=ATmegaBOOT_168_diecimila.hex
diecimila.bootloader.unlock_bits=0x3F
diecimila.bootloader.lock_bits=0x0F

diecimila.build.mcu=atmega168
diecimila.build.f_cpu=16000000L
diecimila.build.core=arduino
diecimila.build.variant=standard

##############################################################

nano328.name=Arduino Nano w/ ATmega328 (16MHz)

nano328.upload.protocol=arduino
nano328.upload.maximum_size=30720
nano328.upload.speed=57600

nano328.bootloader.low_fuses=0xFF
nano328.bootloader.high_fuses=0xDA
nano328.bootloader.extended_fuses=0x05
nano328.bootloader.path=atmega
nano328.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328.bootloader.unlock_bits=0x3F
nano328.bootloader.lock_bits=0x0F

nano328.build.mcu=atmega328p
nano328.build.f_cpu=16000000L
nano328.build.core=arduino
nano328.build.variant=eightanaloginputs

##############################################################

nano328_8MHz.name=Arduino Nano w/ ATmega328 (8MHz)

nano328_8MHz.upload.protocol=arduino
nano328_8MHz.upload.maximum_size=30720
nano328_8MHz.upload.speed=57600

nano328_8MHz.bootloader.low_fuses=0xFF
nano328_8MHz.bootloader.high_fuses=0xDA
nano328_8MHz.bootloader.extended_fuses=0x05
nano328_8MHz.bootloader.path=atmega
nano328_8MHz.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328_8MHz.bootloader.unlock_bits=0x3F
nano328_8MHz.bootloader.lock_bits=0x0F

nano328_8MHz.build.mcu=atmega328p
nano328_8MHz.build.f_cpu=8000000L
nano328_8MHz.build.core=arduino
nano328_8MHz.build.variant=eightanaloginputs

##############################################################

nano328_4MHz.name=Arduino Nano w/ ATmega328 (4MHz)

nano328_4MHz.upload.protocol=arduino
nano328_4MHz.upload.maximum_size=30720
nano328_4MHz.upload.speed=57600

nano328_4MHz.bootloader.low_fuses=0xFF
nano328_4MHz.bootloader.high_fuses=0xDA
nano328_4MHz.bootloader.extended_fuses=0x05
nano328_4MHz.bootloader.path=atmega
nano328_4MHz.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328_4MHz.bootloader.unlock_bits=0x3F
nano328_4MHz.bootloader.lock_bits=0x0F

nano328_4MHz.build.mcu=atmega328p
nano328_4MHz.build.f_cpu=4000000L
nano328_4MHz.build.core=arduino
nano328_4MHz.build.variant=eightanaloginputs

##############################################################

nano328_2MHz.name=Arduino Nano w/ ATmega328 (2MHz)

nano328_2MHz.upload.protocol=arduino
nano328_2MHz.upload.maximum_size=30720
nano328_2MHz.upload.speed=57600

nano328_2MHz.bootloader.low_fuses=0xFF
nano328_2MHz.bootloader.high_fuses=0xDA
nano328_2MHz.bootloader.extended_fuses=0x05
nano328_2MHz.bootloader.path=atmega
nano328_2MHz.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328_2MHz.bootloader.unlock_bits=0x3F
nano328_2MHz.bootloader.lock_bits=0x0F

nano328_2MHz.build.mcu=atmega328p
nano328_2MHz.build.f_cpu=2000000L
nano328_2MHz.build.core=arduino
nano328_2MHz.build.variant=eightanaloginputs

##############################################################

nano328_1MHz.name=Arduino Nano w/ ATmega328 (1MHz)

nano328_1MHz.upload.protocol=arduino
nano328_1MHz.upload.maximum_size=30720
nano328_1MHz.upload.speed=57600

nano328_1MHz.bootloader.low_fuses=0xFF
nano328_1MHz.bootloader.high_fuses=0xDA
nano328_1MHz.bootloader.extended_fuses=0x05
nano328_1MHz.bootloader.path=atmega
nano328_1MHz.bootloader.file=ATmegaBOOT_168_atmega328.hex
nano328_1MHz.bootloader.unlock_bits=0x3F
nano328_1MHz.bootloader.lock_bits=0x0F

nano328_1MHz.build.mcu=atmega328p
nano328_1MHz.build.f_cpu=1000000L
nano328_1MHz.build.core=arduino
nano328_1MHz.build.variant=eightanaloginputs


##############################################################

nano.name=Arduino Nano w/ ATmega168

nano.upload.protocol=arduino
nano.upload.maximum_size=14336
nano.upload.speed=19200

nano.bootloader.low_fuses=0xff
nano.bootloader.high_fuses=0xdd
nano.bootloader.extended_fuses=0x00
nano.bootloader.path=atmega
nano.bootloader.file=ATmegaBOOT_168_diecimila.hex
nano.bootloader.unlock_bits=0x3F
nano.bootloader.lock_bits=0x0F

nano.build.mcu=atmega168
nano.build.f_cpu=16000000L
nano.build.core=arduino
nano.build.variant=eightanaloginputs

##############################################################

mega2560.name=Arduino Mega 2560 or Mega ADK

mega2560.upload.protocol=wiring
mega2560.upload.maximum_size=258048
mega2560.upload.speed=115200

mega2560.bootloader.low_fuses=0xFF
mega2560.bootloader.high_fuses=0xD8
mega2560.bootloader.extended_fuses=0xFD
mega2560.bootloader.path=stk500v2
mega2560.bootloader.file=stk500boot_v2_mega2560.hex
mega2560.bootloader.unlock_bits=0x3F
mega2560.bootloader.lock_bits=0x0F

mega2560.build.mcu=atmega2560
mega2560.build.f_cpu=16000000L
mega2560.build.core=arduino
mega2560.build.variant=mega

